{"config": [{"config": {"trainable": true, "mask_value": -1, "dtype": "float32", "batch_input_shape": [null, 3, 20], "name": "masking_1"}, "class_name": "Masking"}, {"config": {"recurrent_constraint": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "implementation": 1, "name": "lstm_1", "go_backwards": false, "return_sequences": false, "dropout": 0.2, "bias_constraint": null, "activation": "tanh", "bias_regularizer": null, "units": 32, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "batch_input_shape": [null, 3, 20], "stateful": false, "activity_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "LSTM"}, {"config": {"units": 9, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 32]}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Sequential"}